In [1]:
import pandas as pd

# Creating a DataFrame Manually
a Dataframe is basically a table that aloows us tu like work with different document types like csv and organize data in a well mannered way

In [9]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print(dataframe)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

You can also name the rows
Index define what names would the row name be, originally they are number starting from 0

In [10]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]],index=["A","B","C"])
print(dataframe)

   0   1   2   3
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

You can also name the coloumns which is more preffered and is done by using the coloumn

In [11]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]],columns=["A","B","C","D"])
print(dataframe)

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

# Loading Data from CSV and exporting Data to csv

In [42]:
dataframe=pd.read_csv("../Files/Assignment2/coffee.csv")
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso          25
1            1     Monday       Latte          15
2            2    Tuesday    Espresso          30
3            3    Tuesday       Latte          20
4            4  Wednesday    Espresso          35
5            5  Wednesday       Latte          25
6            6   Thursday    Espresso          40
7            7   Thursday       Latte          30
8            8     Friday    Espresso          45
9            9     Friday       Latte          35
10          10   Saturday    Espresso          45
11          11   Saturday       Latte          35
12          12     Sunday    Espresso          45
13          13     Sunday       Latte          35

In [43]:
content.to_csv("../Files/Assignment2/coffee.csv")

# Overwrites the file at this path with the changes

# Accessing Data

.dtypes= gives us the info of the datatypes of each coloumn

In [44]:
dataframe.dtypes

Unnamed: 0     int64
Day              str
Coffee Type      str
Units Sold     int64
dtype: object

.info= gives us the info of the datatypes, memory usage and no of unique values of each coloumn

In [45]:
dataframe.info()

<class 'pandas.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   14 non-null     int64
 1   Day          14 non-null     str
 2   Coffee Type  14 non-null     str
 3   Units Sold   14 non-null     int64
dtypes: int64(2), str(2)
memory usage: 580.0 bytes

.describe= gives us the info of the mean, count minimum value and so on
 of each coloumn

In [46]:
dataframe.describe()

       Unnamed: 0  Units Sold
count     14.0000   14.000000
mean       6.5000   32.857143
std        4.1833    9.346798
min        0.0000   15.000000
25%        3.2500   26.250000
50%        6.5000   35.000000
75%        9.7500   38.750000
max       13.0000   45.000000

In [47]:
dataframe.shape

(14, 4)

.Unique= we can use .unique to find the unique values throughout the table or finding unique values inside a specific coloumn

In [48]:
dataframe.nunique()

Unnamed: 0     14
Day             7
Coffee Type     2
Units Sold      7
dtype: int64

In [51]:
dataframe["Units Sold"].unique()

# works only on numbers

array([25, 15, 30, 20, 35, 40, 45])

In [52]:
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso          25
1            1     Monday       Latte          15
2            2    Tuesday    Espresso          30
3            3    Tuesday       Latte          20
4            4  Wednesday    Espresso          35
5            5  Wednesday       Latte          25
6            6   Thursday    Espresso          40
7            7   Thursday       Latte          30
8            8     Friday    Espresso          45
9            9     Friday       Latte          35
10          10   Saturday    Espresso          45
11          11   Saturday       Latte          35
12          12     Sunday    Espresso          45
13          13     Sunday       Latte          35

Accessing vlaues using loc and iloc
loc=dataframe_name[rows,coloumns]

iloc=dataframe_name[rows,coloumns]

difference= in loc we get by like index name and so on like we can do loc[["A","B"]] but in iloc this will give error and we have to give index like [0,1]

In [53]:
dataframe.loc[[0,1,2],["Day","Coffee Type","Units Sold"]]

# Take rows 1,2,3 from Day,Coffee Type,Units Sold

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [54]:
dataframe.loc[1:5,:]

#spilicing: taking data of from 1 to 5 rows and all coloumns

   Unnamed: 0        Day Coffee Type  Units Sold
1           1     Monday       Latte          15
2           2    Tuesday    Espresso          30
3           3    Tuesday       Latte          20
4           4  Wednesday    Espresso          35
5           5  Wednesday       Latte          25

In [58]:
dataframe.iloc[1:5,[1,2,3]]

         Day Coffee Type  Units Sold
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35